//
//  Text.swift
//  HomeWork-4
//
//  Created by Valeriy Pokatilo on 08.11.2020.
//

struct Text {
	static let iphone4TopText = """
	iPhone 4 — сенсорный смартфон, разработанный корпорацией Apple. Это четвёртое поколение iPhone и преемник iPhone 3GS. Позиционируется для осуществления видеовызовов (под названием FaceTime), использования медиа, в том числе книг и периодических изданий, фильмов, музыки и игр, и для общего доступа к вебу и электронной почте. Был представлен 7 июня 2010 года на Worldwide Developers Conference в Сан-Франциско[1] и был выпущен 24 июня 2010 года в США, Великобритании, Франции, Германии и Японии.

	iPhone 4 работает на операционной системе iOS — на той же операционной системе, которая используется в предыдущих iPhone, iPad и iPod touch. Она главным образом управляется пальцами пользователя на мультитач-дисплее, который чувствителен к контакту пальцев.

	Наиболее заметное различие между iPhone 4 и его предшественниками — это новый дизайн, который включает в себя неизолированную раму из нержавеющей стали, действующую как антенна устройства. Внутренние компоненты устройства расположены между двумя панелями химически укреплённого алюмосиликатного стекла[2]. iPhone 4 имеет процессор Apple A4 и 512 МБ eDRAM, что вдвое больше, чем в его предшественнике, и в четыре раза больше, чем в первом iPhone. Его 3,5-дюймовый (89 мм) ЖК-дисплей со светодиодной подсветкой и с разрешением 960×640 пикселей позиционируется как «Retina Display». Его работу обеспечивает обновлённая графическая подсистема: iPhone 4 работает на базе графического процессора PowerVR SGX535.

	Последняя доступная версия iOS — 7.1.2. 2 июня 2014 на WWDC14 была представлена iOS 8, которая не может быть установлена на iPhone 4.

	В средствах массовой информации появлялись сведения о двух прототипах iPhone 4 перед его официальным представлением 7 июня 2010 года, что нарушило обычный секретный процесс разработки Apple. Многие предположения относительно технических характеристик оказались точными.

	19 апреля 2010 года сайт о гаджетах Gizmodo сообщил, что они купили прототип iPhone за 5000 долларов и разобрали устройство. Прототип, как сообщалось, потерял сотрудник Apple Грэй Пауэлл в Редвуд-сити (штат Калифорния)[3]. Вскоре после публикации в Gizmodo подробной информации о прототипе правовые партнёры Apple официально запросили вернуть телефон в Apple, и Gizmodo ответил с намерением к сотрудничеству[4]. 22 апреля сотрудники правоохранительных органов Калифорнии провели обыск в доме редактора Gizmodo Джейсона Чена, отвечавшего за обзор прототипа, изъяв все его компьютеры и жёсткие диски[5]. Electronic Frontier Foundation подверг обыск критике как нарушение законов о защите журналистских источников, которые запрещают изъятие компьютеров журналистов, а также высказал подозрение, что Apple использовал своё влияние, чтобы подтолкнуть полицию к действиям, которые обычно не проводятся в случаев подобных инцидентов. Gizmodo вернул прототип Apple ещё до обыска[6]. Окружной прокурор заявил, что расследование остановлено и никаких обвинений не предъявлено[7][8].

	Фотографии и видео второго прототипа были опубликованы на вьетнамском сайте Taoviet 12 мая 2010 года[9]. Он был почти идентичен первому и использовал чип А4, произведённый Apple[10]. Сайт приобрёл прототип за 4000 долларов[11]. DigiTimes сообщил, что разрешение экрана нового телефона — 960×640, что Apple подтвердил в официальном анонсе iPhone 4.

	iPhone 4 стал доступен для предварительного заказа 15 июня 2010 года. Клиенты, пытавшиеся сделать предварительный заказ iPhone 4, сообщали о проблемах с процессом заказа в онлайновых Apple Store в США и Великобритании, которые стали недоступными из-за всплеска трафика[12]. Об этой же проблеме с AT&T и SoftBank сообщали эксклюзивные партнёры Apple в США и Японии соответственно, которые приостановили продажи iPhone 4, поскольку спрос грозил превысить предложение[13]. Магазины розничной торговли также не могли завершить транзакции предзаказов из-за того, что серверы становились недоступными[14]. Apple и её партнёры получили 600 тысяч предзаказов на iPhone 4 в первые 24 часа — это самое большое количество предзаказов, которые корпорация Apple получала за один день на любые устройства на тот момент[15] Engadget сообщил, что в 20:30 по UTC все предварительные запасы iPhone 4 были распроданы[16]. 1,7 миллиона iPhone 4 были проданы в первые три дня[17].

	iPhone 4 также был выпущен в сети Orange в Тунисе и при запуске был доступен в восьми городах[18]. В Южной Корее он был выпущен в сети KT 10 сентября. В Израиле он был выпущен 24 сентября в сетях Cellcom, «Пелефон» и Orange. В Таиланде он был выпущен 23 сентября в сетях AIS, DTAC и True Move, а в Малайзии — 26 сентября в Куала-Лумпуре и во всей стране 27 сентября[19]. В Южной Африке iPhone 4 был выпущен 22 сентября в сетях Vodacom и MTN[20] в очень ограниченных количествах — во Вьетнаме 30 сентября в сетях VinaPhone и Viettel, сначала в Ханое, Хошимине и Дананге, а затем по всей стране к концу октября[21][22]. 27 мая 2011 года iPhone 4 был выпущен в Индии в сетях Aircel и Airtel[23].

	24 июня 2010 года Apple выступила с заявлением, что белая модель iPhone 4 оказалась более «сложной в производстве», чем ожидалось, и сначала перенёс её выпуск на вторую половину июля. О причинах задержки белого iPhone 4 ходило много слухов. Самые популярные касались внутренней камеры телефона, страдавшей от попадания света из-за полупрозрачного стекла и белой краски. Другие источники сообщали, что проблема связана с неспособностью Apple привести в соответствие белый цвет передней панели и основной кнопки[28]. 27 апреля 2011 года Apple объявила, что выпустит белые модели iPhone 4 28 апреля 2011 и для GSM, и для CDMA[29] Белый iPhone 4 был выпущен 28 апреля.[30].
	"""
}
