//
//  Text.swift
//  HomeWork-4
//
//  Created by Valeriy Pokatilo on 08.11.2020.
//

struct Text {
	static let iphone2Header = "iPhone 2"
	static let iphone2PreText = "Первый Iphone"
	static let iphone2Text = """
	iPhone (ретроспективно называемый первым iPhone или iPhone 2G) — сенсорный смартфон первого поколения iPhone, разработанный и продававшийся корпорацией Apple. Был представлен 9 января 2007 года[3] после нескольких месяцев слухов[4]. Поступил в продажу в США 29 июня 2007 года. Вторым поколением стал iPhone 3G.

	Первый iPhone уже не получает обновлений программного обеспечения от Apple, последней версией его прошивки была iPhone OS 3.1.3.
	"""
	static let iphone2Time = "16:02"

	static let iphone4Header = "iPhone 4\niPhone 4"
	static let iphone4PreText = "Четвёртое поколение"
	static let iphone4Text = """
	iPhone 4 — сенсорный смартфон, разработанный корпорацией Apple. Это четвёртое поколение iPhone и преемник iPhone 3GS. Позиционируется для осуществления видеовызовов (под названием FaceTime), использования медиа, в том числе книг и периодических изданий, фильмов, музыки и игр, и для общего доступа к вебу и электронной почте. Был представлен 7 июня 2010 года на Worldwide Developers Conference в Сан-Франциско[1] и был выпущен 24 июня 2010 года в США, Великобритании, Франции, Германии и Японии.

	iPhone 4 работает на операционной системе iOS — на той же операционной системе, которая используется в предыдущих iPhone, iPad и iPod touch. Она главным образом управляется пальцами пользователя на мультитач-дисплее, который чувствителен к контакту пальцев.

	Наиболее заметное различие между iPhone 4 и его предшественниками — это новый дизайн, который включает в себя неизолированную раму из нержавеющей стали, действующую как антенна устройства. Внутренние компоненты устройства расположены между двумя панелями химически укреплённого алюмосиликатного стекла[2]. iPhone 4 имеет процессор Apple A4 и 512 МБ eDRAM, что вдвое больше, чем в его предшественнике, и в четыре раза больше, чем в первом iPhone. Его 3,5-дюймовый (89 мм) ЖК-дисплей со светодиодной подсветкой и с разрешением 960×640 пикселей позиционируется как «Retina Display». Его работу обеспечивает обновлённая графическая подсистема: iPhone 4 работает на базе графического процессора PowerVR SGX535.

	Последняя доступная версия iOS — 7.1.2. 2 июня 2014 на WWDC14 была представлена iOS 8, которая не может быть установлена на iPhone 4.

	В средствах массовой информации появлялись сведения о двух прототипах iPhone 4 перед его официальным представлением 7 июня 2010 года, что нарушило обычный секретный процесс разработки Apple. Многие предположения относительно технических характеристик оказались точными.

	19 апреля 2010 года сайт о гаджетах Gizmodo сообщил, что они купили прототип iPhone за 5000 долларов и разобрали устройство. Прототип, как сообщалось, потерял сотрудник Apple Грэй Пауэлл в Редвуд-сити (штат Калифорния)[3]. Вскоре после публикации в Gizmodo подробной информации о прототипе правовые партнёры Apple официально запросили вернуть телефон в Apple, и Gizmodo ответил с намерением к сотрудничеству[4]. 22 апреля сотрудники правоохранительных органов Калифорнии провели обыск в доме редактора Gizmodo Джейсона Чена, отвечавшего за обзор прототипа, изъяв все его компьютеры и жёсткие диски[5]. Electronic Frontier Foundation подверг обыск критике как нарушение законов о защите журналистских источников, которые запрещают изъятие компьютеров журналистов, а также высказал подозрение, что Apple использовал своё влияние, чтобы подтолкнуть полицию к действиям, которые обычно не проводятся в случаев подобных инцидентов. Gizmodo вернул прототип Apple ещё до обыска[6]. Окружной прокурор заявил, что расследование остановлено и никаких обвинений не предъявлено[7][8].

	Фотографии и видео второго прототипа были опубликованы на вьетнамском сайте Taoviet 12 мая 2010 года[9]. Он был почти идентичен первому и использовал чип А4, произведённый Apple[10]. Сайт приобрёл прототип за 4000 долларов[11]. DigiTimes сообщил, что разрешение экрана нового телефона — 960×640, что Apple подтвердил в официальном анонсе iPhone 4.

	iPhone 4 стал доступен для предварительного заказа 15 июня 2010 года. Клиенты, пытавшиеся сделать предварительный заказ iPhone 4, сообщали о проблемах с процессом заказа в онлайновых Apple Store в США и Великобритании, которые стали недоступными из-за всплеска трафика[12]. Об этой же проблеме с AT&T и SoftBank сообщали эксклюзивные партнёры Apple в США и Японии соответственно, которые приостановили продажи iPhone 4, поскольку спрос грозил превысить предложение[13]. Магазины розничной торговли также не могли завершить транзакции предзаказов из-за того, что серверы становились недоступными[14]. Apple и её партнёры получили 600 тысяч предзаказов на iPhone 4 в первые 24 часа — это самое большое количество предзаказов, которые корпорация Apple получала за один день на любые устройства на тот момент[15] Engadget сообщил, что в 20:30 по UTC все предварительные запасы iPhone 4 были распроданы[16]. 1,7 миллиона iPhone 4 были проданы в первые три дня[17].

	iPhone 4 также был выпущен в сети Orange в Тунисе и при запуске был доступен в восьми городах[18]. В Южной Корее он был выпущен в сети KT 10 сентября. В Израиле он был выпущен 24 сентября в сетях Cellcom, «Пелефон» и Orange. В Таиланде он был выпущен 23 сентября в сетях AIS, DTAC и True Move, а в Малайзии — 26 сентября в Куала-Лумпуре и во всей стране 27 сентября[19]. В Южной Африке iPhone 4 был выпущен 22 сентября в сетях Vodacom и MTN[20] в очень ограниченных количествах — во Вьетнаме 30 сентября в сетях VinaPhone и Viettel, сначала в Ханое, Хошимине и Дананге, а затем по всей стране к концу октября[21][22]. 27 мая 2011 года iPhone 4 был выпущен в Индии в сетях Aircel и Airtel[23].

	24 июня 2010 года Apple выступила с заявлением, что белая модель iPhone 4 оказалась более «сложной в производстве», чем ожидалось, и сначала перенёс её выпуск на вторую половину июля. О причинах задержки белого iPhone 4 ходило много слухов. Самые популярные касались внутренней камеры телефона, страдавшей от попадания света из-за полупрозрачного стекла и белой краски. Другие источники сообщали, что проблема связана с неспособностью Apple привести в соответствие белый цвет передней панели и основной кнопки[28]. 27 апреля 2011 года Apple объявила, что выпустит белые модели iPhone 4 28 апреля 2011 и для GSM, и для CDMA[29] Белый iPhone 4 был выпущен 28 апреля.[30].
	"""
	static let iphone4Time = "20:45"



	static let iphone8Header = "iPhone 8"
	static let iphone8PreText = "iPhone 8 и iPhone 8 Plus — смартфоны корпорации Apple, использующие процессор Apple A11 Bionic и операционную систему iOS 11"
	static let iphone8Text = """
	iPhone 8 и iPhone 8 Plus — смартфоны корпорации Apple, использующие процессор Apple A11 Bionic и операционную систему iOS 11, представленные 12 сентября 2017 года вместе с iPhone X в театре Стива Джобса[2]. Диагональ экрана и разрешение были оставлены без изменений по сравнению с предыдущими моделями: iPhone 6s и 7; 6s Plus и 7 Plus. Толщина телефона — 7,3-7,5 мм, без учёта модуля основной камеры, немного выступающей за пределы задней плоскости. Смартфоны используют только порт Lightning. Основное отличие от предыдущих моделей кроме увеличенных цены и аккумулятора — внедрение беспроводной зарядки по стандарту беспроводного питания Qi.
	"""
	static let iphone8Time = ""

	static let iphoneXHeader = "iPhone X"
	static let iphoneXPreText = "iPhone X (произносится как iPhone Ten) — смартфон корпорации Apple семейства iPhone"
	static let iphoneXText = """
	iPhone X (произносится как iPhone Ten) — смартфон корпорации Apple семейства iPhone. Представлен 12 сентября 2017 года вместе с iPhone 8 и iPhone 8 Plus в Театре Стива Джобса[4]. Этот смартфон использует процессор Apple A11.

	Нумерация модели (после 8-го сразу 10-й, пропустив 9-й), вероятно, объясняется тем, что выпуск модели был приурочен к десятой годовщине первой модели iPhone[5].
	"""
	static let iphoneXTime = "14:12"

	static let iphone12Header = "iPhone 12"
	static let iphone12PreText = ""
	static let iphone12Text = """
	iPhone 12 и iPhone 12 mini — смартфоны п р о и з в о д с т в а корпорации Apple.

	iPhone 12 является базовой моделью[4] 14-го поколения[5], пришедшей на смену смартфону iPhone 11[6]. Представлен 13 октября 2020 года вместе со своим «младшим братом» (уменьшенной версией) iPhone 12 mini и «профессиональными» моделями iPhone 12 Pro и iPhone 12 Pro Max[7][8][4]. Это первое поколение смартфонов от Apple, поддерживающее стандарт сотовой связи 5G[6][8][9][10].

	Уменьшенная версия, получившая название «iPhone 12 mini», имеет такой же процессор и такие же камеры, как и базовый iPhone 12, но обладает меньшими габаритами: экраном с диагональю 5,4 дюйма[4] и весом в 133—135 граммов[2]. Все основные характеристики идентичны характеристикам базовой модели, отличаются только диагональ и разрешение экрана и ёмкость аккумулятора.
	"""
	static let iphone12Time = ""
}
