//
//  Text.swift
//  HomeWork-4
//
//  Created by Valeriy Pokatilo on 08.11.2020.
//

struct Text {
	static let iphone4 = """
	iPhone 4 — сенсорный смартфон, разработанный корпорацией Apple. Это четвёртое поколение iPhone и преемник iPhone 3GS. Позиционируется для осуществления видеовызовов (под названием FaceTime), использования медиа, в том числе книг и периодических изданий, фильмов, музыки и игр, и для общего доступа к вебу и электронной почте. Был представлен 7 июня 2010 года на Worldwide Developers Conference в Сан-Франциско[1] и был выпущен 24 июня 2010 года в США, Великобритании, Франции, Германии и Японии.

	iPhone 4 работает на операционной системе iOS — на той же операционной системе, которая используется в предыдущих iPhone, iPad и iPod touch. Она главным образом управляется пальцами пользователя на мультитач-дисплее, который чувствителен к контакту пальцев.

	Наиболее заметное различие между iPhone 4 и его предшественниками — это новый дизайн, который включает в себя неизолированную раму из нержавеющей стали, действующую как антенна устройства. Внутренние компоненты устройства расположены между двумя панелями химически укреплённого алюмосиликатного стекла[2]. iPhone 4 имеет процессор Apple A4 и 512 МБ eDRAM, что вдвое больше, чем в его предшественнике, и в четыре раза больше, чем в первом iPhone. Его 3,5-дюймовый (89 мм) ЖК-дисплей со светодиодной подсветкой и с разрешением 960×640 пикселей позиционируется как «Retina Display». Его работу обеспечивает обновлённая графическая подсистема: iPhone 4 работает на базе графического процессора PowerVR SGX535.

	Последняя доступная версия iOS — 7.1.2. 2 июня 2014 на WWDC14 была представлена iOS 8, которая не может быть установлена на iPhone 4.
	"""
}
